# ==========================================================================
# Brewfile — declarative source of truth for Homebrew dependencies
# Usage: brew bundle [--file=Brewfile]
# ==========================================================================

# --- CLI tools ------------------------------------------------------------
brew "git"
brew "ghq"
brew "gcc"
brew "gh"
brew "wget"
brew "curl"
brew "tmux"
brew "zellij"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "eza"
brew "neovim"
brew "git-delta"
brew "lazygit"
brew "pinentry-mac"
brew "sqlite"
brew "lima"
brew "qemu"

# --- yazi + deps ----------------------------------------------------------
brew "yazi"
brew "ffmpeg"
brew "sevenzip"
brew "jq"
brew "poppler"
brew "fd"
brew "zoxide"
brew "resvg"
brew "imagemagick"

# --- Shell helper ---------------------------------------------------------
brew "gum"

# --- GUI apps (casks) -----------------------------------------------------
cask "ghostty"
cask "betterdisplay"
cask "docker-desktop"
cask "vivaldi"
cask "codex"
cask "font-lilex-nerd-font"
cask "font-symbols-only-nerd-font"
